{
  "common": {
    "name": "vis-2-widgets-inventwo",
    "version": "0.2.1",
    "news": {
      "0.2.1": {
        "en": "Fixed build issue",
        "de": "Fixed Build Problem",
        "ru": "Проблема фиксированного строительства",
        "pt": "Problema de compilação fixo",
        "nl": "Probleem met vaste bouw",
        "fr": "Problème de construction fixe",
        "it": "Problema di costruzione fisso",
        "es": "Cuestiones de construcción fijas",
        "pl": "Emisja stałych budynków",
        "uk": "Виправлено проблему побудови",
        "zh-cn": "固定建筑问题"
      },
      "0.2.0": {
        "en": "Fixed dialog is opened on page load and view change\nNew widget: Table",
        "de": "Feste Dialog wird auf Seite laden und Ansicht ändern geöffnet\nNeues Widget: Tabelle",
        "ru": "Фиксированный диалог открывается при загрузке страницы и изменении просмотра\nНовый виджет: стол",
        "pt": "A caixa de diálogo fixa é aberta na página carregar e visualizar a mudança\nNovo widget: Tabela",
        "nl": "Vast dialoogvenster wordt geopend op pagina laden en weergave wijzigen\nNieuw widget: Tabel",
        "fr": "La boîte de dialogue fixe est ouverte lors du chargement et de la visualisation de la page\nNouveau widget : Table",
        "it": "La finestra di dialogo fissa è aperta sul carico della pagina e la modifica della vista\nNuovo widget: Table",
        "es": "Diálogo fijo se abre en la carga de página y el cambio de vista\nNuevo widget: Tabla",
        "pl": "Stałe okno dialogowe jest otwierane przy obciążeniu strony i zmianie widoku\nNowy widget: Tabela",
        "uk": "Виправлено діалогове вікно відкривається на завантаження сторінок та зміни перегляду\nНовий віджет: Стіл",
        "zh-cn": "固定对话框在页面加载和视图更改时打开\n新部件: 表格"
      },
      "0.1.12": {
        "en": "Fixed view in dialog is not triggered on state change and state value is not set when opened (#30)\nAdded function to color images (#38)\nAllow custom size for dialog by using binding (#39)\nFix dialog \"close on click from outside\" checkbox was inverted (#42)",
        "de": "Feste Ansicht im Dialog wird bei geöffnetem Zustandswechsel nicht ausgelöst und Zustandswert nicht gesetzt (#30)\nFunktion zu Farbbildern hinzugefügt (#38)\nErlauben Sie benutzerdefinierte Größe für Dialog mit Bindung (#39)\nFix Dialog \"Klick von außen schließen\" Checkbox wurde invertiert (#42)",
        "ru": "Фиксированный вид в диалоге не срабатывает при изменении состояния и значение состояния не устанавливается при открытии (#30)\nДобавлена функция цветных изображений (#38)\nРазрешить пользовательский размер для диалога с помощью связывания (#39)\nИсправлен диалог \"закрыть на клик снаружи\" флажок был перевернут (#42)",
        "pt": "A visualização fixa na caixa de diálogo não é ativada na mudança do estado e o valor do estado não é definido quando aberto (#30)\nFunção adicionada a imagens coloridas (#38)\nPermitir tamanho personalizado para diálogo usando ligação (#39)\nCorrigir diálogo \"fechar no clique de fora\" caixa de seleção foi invertido (#42)",
        "nl": "Vaste weergave in het dialoogvenster wordt niet geactiveerd bij statusverandering en statuswaarde wordt niet ingesteld wanneer geopend (#30)\nFunctie toegevoegd aan kleurafbeeldingen (#38)\nAangepaste grootte voor dialoog toestaan door binding (#39) te gebruiken\nHet dialoogvenster \"close on click from outside\" werd omgekeerd (#42)",
        "fr": "La vue fixe dans la boîte de dialogue n'est pas déclenchée par changement d'état et la valeur d'état n'est pas définie lors de l'ouverture (#30)\nAjout de la fonction aux images couleur (#38)\nPermettre une taille personnalisée pour la boîte de dialogue en utilisant la liaison (#39)\nCorrection de la boîte de dialogue \"fermer le clic de l'extérieur\" a été inversée (#42)",
        "it": "La visualizzazione fissa nella finestra di dialogo non viene attivata sul cambiamento di stato e il valore di stato non viene impostato quando aperto (#30)\nFunzione aggiunta alle immagini di colore (#38)\nConsentire dimensioni personalizzate per la finestra di dialogo utilizzando binding (#39)\nFissare la finestra di dialogo \"chiudi su clic dall'esterno\" la casella di controllo è stata invertita (#42)",
        "es": "Vista fija en el diálogo no se activa en el cambio del estado y el valor del estado no se establece cuando se abre (#30)\nFunción agregada a las imágenes de color (#38)\nPermitir el tamaño personalizado para el diálogo mediante la unión (#39)\nSe invirtió el cuadro de diálogo \"cerrar el clic desde fuera\" (#42)",
        "pl": "Nie jest uruchamiany stały widok w oknie dialogowym przy zmianie stanu, a wartość stanu nie jest ustawiana po otwarciu (# 30)\nDodano funkcję do kolorowych obrazów (# 38)\nZezwalaj na niestandardowy rozmiar okna dialogowego za pomocą połączenia (# 39)\nOkno dialogowe \"Zamknij kliknięcie z zewnątrz\" zostało odwrócone (# 42)",
        "uk": "Виправлено вид у діалоговому вікні не викликається змінами стану та значенням держави не встановлено при відкритті (#30)\nДодано функцію до кольорових зображень (#38)\nДозволити користувальницький розмір для діалогу, використовуючи посилання (#39)\nВиправлено діалогове вікно \"закривати натиснути ззовні\" прапорець було перевернуто (#42)",
        "zh-cn": "对话框中的固定视图不会在状态变化时触发, 状态值在打开时没有设置 (# 30)\n添加到颜色图像中的函数 (# 38)\n使用绑定(# 39) 允许自定义对话框大小\n修补对话框“ 从外部点击关闭” 复选框被反转 (# 42)"
      },
      "0.1.11": {
        "en": "Fixed issues mentioned by eslint",
        "de": "Behobene Probleme von eslint",
        "ru": "Исправленные вопросы, упомянутые eslint",
        "pt": "Questões fixas mencionadas por eslint",
        "nl": "Vaste emissies genoemd door eslint",
        "fr": "Problèmes corrigés mentionnés par eslint",
        "it": "Questioni fisse menzionate da eslint",
        "es": "Cuestiones fijas mencionadas por eslint",
        "pl": "Poprawione kwestie wymienione przez eslint",
        "uk": "Виправлені питання, зазначені еслінтом",
        "zh-cn": "Eslint提到的固定问题"
      },
      "0.1.9": {
        "en": "Fixed missing object id if type is nav (#14)\nFixed content color for icons not working (#22)",
        "de": "Fixed fehlende object id, wenn Typ nav ist (#14)\nFeste Inhaltsfarbe für Icons, die nicht funktionieren (#22)",
        "ru": "Fixed missing object id if type is nav (#14)\nФиксированный цвет контента для значков, не работающих (#22)",
        "pt": "ID de objeto ausente fixo se o tipo é nav (#14)\nCor de conteúdo fixo para ícones que não funcionam (#22)",
        "nl": "Vaste ontbrekende object id als het type navigatiesysteem is (#14)\nKleur van vaste inhoud voor pictogrammen die niet werken (#22)",
        "fr": "Correction de l'identifiant d'objet manquant si le type est nav (#14)\nCouleur de contenu fixe pour les icônes ne fonctionnant pas (#22)",
        "it": "Risolto oggetto mancante id se il tipo è nav (#14)\nColore del contenuto fisso per icone che non funzionano (#22)",
        "es": "Objeto perdido fijo id si el tipo es nav (#14)\nColor de contenido fijo para iconos que no funcionan (#22)",
        "pl": "Naprawiono brak identyfikatora obiektu, jeśli typ jest nawigacją (# 14)\nPoprawiony kolor zawartości dla ikon nie działa (# 22)",
        "uk": "Виправлено відсутній об'єкт, якщо тип нав (#14)\nФіксований колір вмісту для ікон не працює (#22)",
        "zh-cn": "如果类型为导航( # 14) , 则固定缺失对象 ID\n不工作的图标的固定内容颜色(# 22)"
      },
      "0.1.5": {
        "en": "Added optional button click feedback options\nAdded widget type to send http requests and open urls",
        "de": "Optionale Schaltfläche klicken Sie auf Feedback-Optionen\nHinzugefügt Widget-Typ, um http-Anfragen und offene URLs zu senden",
        "ru": "Добавить опции обратной связи нажатия кнопки\nДобавить виджета для отправки запросов http и открытых URL",
        "pt": "Adicionado opcional botão clique opções de feedback\nAdicionado tipo de widget para enviar solicitações http e abrir urls",
        "nl": "Toegevoegd optionele knop klik feedback opties\nToegevoegd widgettype om http-verzoeken te versturen en urls te openen",
        "fr": "Ajout du bouton optionnel cliquez sur les options de rétroaction\nAjout du type de widget pour envoyer les requêtes http et ouvrir les urls",
        "it": "Aggiunta opzione pulsante clicca opzioni di feedback\nAggiunto tipo di widget per inviare http richieste e URL aperti",
        "es": "Opciones de retroalimentación de botón opcional\nTipo de widget añadido para enviar solicitudes http y urls abiertos",
        "pl": "Dodano opcjonalne kliknięcie przycisku opcji sprzężenia zwrotnego\nDodano typ widget do wysyłania zapytań http i otwartych url",
        "uk": "Додано додаткові кнопки натисніть Параметри зворотного зв'язку\nДодано тип віджету для надсилання HTTP запитів та відкритих URL-адрес",
        "zh-cn": "添加可选按钮点击反馈选项\n添加部件类型以发送 http 请求并打开 urls"
      },
      "0.1.2": {
        "en": "Fixed issue editor crashes when changing \"Comparison operator\" or \"Compare by\" on multiple states.\nFixesd issue state settings not used if condition is true.",
        "de": "Der Fixed-Editor stürzt beim Wechsel von \"Comparison Operator\" oder \"Compare by\" auf mehreren Zuständen ab.\nFeste Ausgabezustandseinstellungen, die nicht verwendet werden, wenn die Bedingung wahr ist.",
        "ru": "Исправленный редактор проблем терпит крушение при изменении «оператора сравнения» или «Сравнить» на нескольких состояниях.\nИсправленные настройки состояния проблемы не используются, если условие верно.",
        "pt": "O editor de edição corrigido trava ao alterar \"o operador da empresa\" ou \"Compare by\" em vários estados.\nConfigurações de estado de problema corrigidas não usadas se a condição for verdadeira.",
        "nl": "Fixed issue editor crasht bij het veranderen van \"Comparison operator\" of \"Compare by\" op meerdere staten.\nFixesd issue status instellingen niet gebruikt als de conditie waar is.",
        "fr": "L'éditeur de problèmes corrigé s'écrase en modifiant \"Comparison Operator\" ou \"Compare by\" sur plusieurs états.\nRéglage des paramètres d'état de problème non utilisés si la condition est vraie.",
        "it": "L'editor di problemi fissi si blocca quando si cambia \"operatore di Comparison\" o \"Compare by\" su più stati.\nImpostazioni di stato del problema fisso non utilizzate se la condizione è vera.",
        "es": "El editor de edición fijo se bloquea al cambiar \"operador de comparación\" o \"Comparar by\" en varios estados.\nConfiguración de estado de emisión fija no se utiliza si la condición es verdadera.",
        "pl": "Poprawiony edytor wydania awarii przy zmianie \"Operator porównania\" lub \"Porównaj przez\" w wielu stanach.\nFixesd wydaje ustawienia stanu nie używane, jeśli warunek jest prawdziwy.",
        "uk": "Виправлено помилку редактора виписки при зміні \"Компанія\" або \"Порівняти\" на декількох штатах.\nВиправлення параметрів стану виписки не використовуються, якщо стан є істинним.",
        "zh-cn": "固定发行编辑器在多个状态上更改\"比较操作员\"或\"Compare by\"时崩溃.\n如果条件属实,则未使用已修复的状态设置 ."
      }
    },
    "titleLang": {
      "en": "Vis 2 inventwo widgets",
      "de": "Vis 2 inventwo Widgets",
      "ru": "Vis 2 inventwo widgets",
      "pt": "Vis 2 inventwo widgets",
      "nl": "Vis 2 inventwo widgets",
      "fr": "Vis 2 widgets inventwo",
      "it": "Vis 2 widgets inventwo",
      "es": "Vis 2 widgets inventwo",
      "pl": "Vis 2 wynalazły dwa widżety",
      "uk": "Vis 2 inventwo віджети",
      "zh-cn": "Vis 2 输入两个部件"
    },
    "desc": {
      "en": "Vis 2 inventwo widgets",
      "de": "Vis 2 inventwo Widgets",
      "ru": "Vis 2 inventwo widgets",
      "pt": "Vis 2 inventwo widgets",
      "nl": "Vis 2 inventwo widgets",
      "fr": "Vis 2 widgets inventwo",
      "it": "Vis 2 widgets inventwo",
      "es": "Vis 2 widgets inventwo",
      "pl": "Vis 2 wynalazły dwa widżety",
      "uk": "Vis 2 inventwo віджети",
      "zh-cn": "Vis 2 输入两个部件"
    },
    "authors": [
      "jkvarel <jk@inventwo.com>"
    ],
    "keywords": [
      "vis-2-widgets-inventwo"
    ],
    "platform": "Javascript/Node.js",
    "icon": "vis-2-widgets-inventwo.png",
    "extIcon": "https://raw.githubusercontent.com/inventwo/ioBroker.vis-2-widgets-inventwo/master/admin/vis-2-widgets-inventwo.png",
    "enabled": true,
    "readme": "https://github.com/inventwo/ioBroker.vis-2-widgets-inventwo/blob/master/README.md",
    "loglevel": "info",
    "mode": "none",
    "singleton": true,
    "adminUI": {
      "config": "none"
    },
    "nogit": true,
    "onlyWWW": true,
    "type": "visualization-widgets",
    "connectionType": "cloud",
    "dataSource": "poll",
    "visWidgets": {
      "vis2Inventwo": {
        "i18n": "component",
        "name": "vis2Inventwo",
        "url": "vis-2-widgets-inventwo/customWidgets.js",
        "components": [
          "InventwoWidgetUniversal",
          "InventwoWidgetSlider",
          "InventwoWidgetSwitch",
          "InventwoWidgetTable"
        ]
      }
    },
    "restartAdapters": [
      "vis-2"
    ],
    "tier": 3,
    "licenseInformation": {
      "license": "MIT",
      "type": "free",
      "link": "https://github.com/inventwo/ioBroker.vis-2-widgets-inventwo/blob/master/LICENSE"
    }
  },
  "native": {},
  "objects": [],
  "instanceObjects": []
}
