{
  "common": {
    "name": "vis-2-widgets-inventwo",
    "version": "0.1.11",
    "news": {
      "0.1.11": {
        "en": "Fixed issues mentioned by eslint",
        "de": "Behobene Probleme von eslint",
        "ru": "Исправленные вопросы, упомянутые eslint",
        "pt": "Questões fixas mencionadas por eslint",
        "nl": "Vaste emissies genoemd door eslint",
        "fr": "Problèmes corrigés mentionnés par eslint",
        "it": "Questioni fisse menzionate da eslint",
        "es": "Cuestiones fijas mencionadas por eslint",
        "pl": "Poprawione kwestie wymienione przez eslint",
        "uk": "Виправлені питання, зазначені еслінтом",
        "zh-cn": "Eslint提到的固定问题"
      },
      "0.1.9": {
        "en": "Fixed missing object id if type is nav (#14)\nFixed content color for icons not working (#22)",
        "de": "Fixed fehlende object id, wenn Typ nav ist (#14)\nFeste Inhaltsfarbe für Icons, die nicht funktionieren (#22)",
        "ru": "Fixed missing object id if type is nav (#14)\nФиксированный цвет контента для значков, не работающих (#22)",
        "pt": "ID de objeto ausente fixo se o tipo é nav (#14)\nCor de conteúdo fixo para ícones que não funcionam (#22)",
        "nl": "Vaste ontbrekende object id als het type navigatiesysteem is (#14)\nKleur van vaste inhoud voor pictogrammen die niet werken (#22)",
        "fr": "Correction de l'identifiant d'objet manquant si le type est nav (#14)\nCouleur de contenu fixe pour les icônes ne fonctionnant pas (#22)",
        "it": "Risolto oggetto mancante id se il tipo è nav (#14)\nColore del contenuto fisso per icone che non funzionano (#22)",
        "es": "Objeto perdido fijo id si el tipo es nav (#14)\nColor de contenido fijo para iconos que no funcionan (#22)",
        "pl": "Naprawiono brak identyfikatora obiektu, jeśli typ jest nawigacją (# 14)\nPoprawiony kolor zawartości dla ikon nie działa (# 22)",
        "uk": "Виправлено відсутній об'єкт, якщо тип нав (#14)\nФіксований колір вмісту для ікон не працює (#22)",
        "zh-cn": "如果类型为导航( # 14) , 则固定缺失对象 ID\n不工作的图标的固定内容颜色(# 22)"
      },
      "0.1.5": {
        "en": "Added optional button click feedback options\nAdded widget type to send http requests and open urls",
        "de": "Optionale Schaltfläche klicken Sie auf Feedback-Optionen\nHinzugefügt Widget-Typ, um http-Anfragen und offene URLs zu senden",
        "ru": "Добавить опции обратной связи нажатия кнопки\nДобавить виджета для отправки запросов http и открытых URL",
        "pt": "Adicionado opcional botão clique opções de feedback\nAdicionado tipo de widget para enviar solicitações http e abrir urls",
        "nl": "Toegevoegd optionele knop klik feedback opties\nToegevoegd widgettype om http-verzoeken te versturen en urls te openen",
        "fr": "Ajout du bouton optionnel cliquez sur les options de rétroaction\nAjout du type de widget pour envoyer les requêtes http et ouvrir les urls",
        "it": "Aggiunta opzione pulsante clicca opzioni di feedback\nAggiunto tipo di widget per inviare http richieste e URL aperti",
        "es": "Opciones de retroalimentación de botón opcional\nTipo de widget añadido para enviar solicitudes http y urls abiertos",
        "pl": "Dodano opcjonalne kliknięcie przycisku opcji sprzężenia zwrotnego\nDodano typ widget do wysyłania zapytań http i otwartych url",
        "uk": "Додано додаткові кнопки натисніть Параметри зворотного зв'язку\nДодано тип віджету для надсилання HTTP запитів та відкритих URL-адрес",
        "zh-cn": "添加可选按钮点击反馈选项\n添加部件类型以发送 http 请求并打开 urls"
      },
      "0.1.2": {
        "en": "Fixed issue editor crashes when changing \"Comparison operator\" or \"Compare by\" on multiple states.\nFixesd issue state settings not used if condition is true.",
        "de": "Der Fixed-Editor stürzt beim Wechsel von \"Comparison Operator\" oder \"Compare by\" auf mehreren Zuständen ab.\nFeste Ausgabezustandseinstellungen, die nicht verwendet werden, wenn die Bedingung wahr ist.",
        "ru": "Исправленный редактор проблем терпит крушение при изменении «оператора сравнения» или «Сравнить» на нескольких состояниях.\nИсправленные настройки состояния проблемы не используются, если условие верно.",
        "pt": "O editor de edição corrigido trava ao alterar \"o operador da empresa\" ou \"Compare by\" em vários estados.\nConfigurações de estado de problema corrigidas não usadas se a condição for verdadeira.",
        "nl": "Fixed issue editor crasht bij het veranderen van \"Comparison operator\" of \"Compare by\" op meerdere staten.\nFixesd issue status instellingen niet gebruikt als de conditie waar is.",
        "fr": "L'éditeur de problèmes corrigé s'écrase en modifiant \"Comparison Operator\" ou \"Compare by\" sur plusieurs états.\nRéglage des paramètres d'état de problème non utilisés si la condition est vraie.",
        "it": "L'editor di problemi fissi si blocca quando si cambia \"operatore di Comparison\" o \"Compare by\" su più stati.\nImpostazioni di stato del problema fisso non utilizzate se la condizione è vera.",
        "es": "El editor de edición fijo se bloquea al cambiar \"operador de comparación\" o \"Comparar by\" en varios estados.\nConfiguración de estado de emisión fija no se utiliza si la condición es verdadera.",
        "pl": "Poprawiony edytor wydania awarii przy zmianie \"Operator porównania\" lub \"Porównaj przez\" w wielu stanach.\nFixesd wydaje ustawienia stanu nie używane, jeśli warunek jest prawdziwy.",
        "uk": "Виправлено помилку редактора виписки при зміні \"Компанія\" або \"Порівняти\" на декількох штатах.\nВиправлення параметрів стану виписки не використовуються, якщо стан є істинним.",
        "zh-cn": "固定发行编辑器在多个状态上更改\"比较操作员\"或\"Compare by\"时崩溃.\n如果条件属实,则未使用已修复的状态设置 ."
      }
    },
    "titleLang": {
      "en": "Vis 2 inventwo widgets",
      "de": "Vis 2 inventwo Widgets",
      "ru": "Vis 2 inventwo widgets",
      "pt": "Vis 2 inventwo widgets",
      "nl": "Vis 2 inventwo widgets",
      "fr": "Vis 2 widgets inventwo",
      "it": "Vis 2 widgets inventwo",
      "es": "Vis 2 widgets inventwo",
      "pl": "Vis 2 wynalazły dwa widżety",
      "uk": "Vis 2 inventwo віджети",
      "zh-cn": "Vis 2 输入两个部件"
    },
    "desc": {
      "en": "Vis 2 inventwo widgets",
      "de": "Vis 2 inventwo Widgets",
      "ru": "Vis 2 inventwo widgets",
      "pt": "Vis 2 inventwo widgets",
      "nl": "Vis 2 inventwo widgets",
      "fr": "Vis 2 widgets inventwo",
      "it": "Vis 2 widgets inventwo",
      "es": "Vis 2 widgets inventwo",
      "pl": "Vis 2 wynalazły dwa widżety",
      "uk": "Vis 2 inventwo віджети",
      "zh-cn": "Vis 2 输入两个部件"
    },
    "authors": [
      "jkvarel <jk@inventwo.com>"
    ],
    "keywords": [
      "vis-2-widgets-inventwo"
    ],
    "platform": "Javascript/Node.js",
    "icon": "vis-2-widgets-inventwo.png",
    "extIcon": "https://raw.githubusercontent.com/inventwo/ioBroker.vis-2-widgets-inventwo/master/admin/vis-2-widgets-inventwo.png",
    "enabled": true,
    "readme": "https://github.com/inventwo/ioBroker.vis-2-widgets-inventwo/blob/master/README.md",
    "loglevel": "info",
    "mode": "none",
    "singleton": true,
    "adminUI": {
      "config": "none"
    },
    "nogit": true,
    "onlyWWW": true,
    "type": "visualization-widgets",
    "connectionType": "cloud",
    "dataSource": "poll",
    "visWidgets": {
      "vis2Inventwo": {
        "i18n": "component",
        "name": "vis2Inventwo",
        "url": "vis-2-widgets-inventwo/customWidgets.js",
        "components": [
          "InventwoWidgetUniversal",
          "InventwoWidgetSlider",
          "InventwoWidgetSwitch"
        ]
      }
    },
    "restartAdapters": [
      "vis-2"
    ],
    "tier": 3,
    "licenseInformation": {
      "license": "MIT",
      "type": "free",
      "link": "https://github.com/inventwo/ioBroker.vis-2-widgets-inventwo/blob/master/LICENSE"
    }
  },
  "native": {},
  "objects": [],
  "instanceObjects": []
}
